Repository: iThoughts-Informatique/iThoughts-Advanced-Code-Editor
Catalog: lang/ithoughts-advanced-code-editor-*.po
Languages: fr_fr

source: Report a false positive/negative codecheck
fr_fr: Rapporter un faux positif/négatif dans la vérification de code

source: http://www.gerkindevelopment.net/en/portfolio/ithoughts-advanced-code-editor
fr_fr: http://www.gerkindevelopment.net/portfolio/ithoughts-advanced-code-editor

source: Integrate the Code Editor Ace into your WordPress editors to help you write efficient code!
fr_fr: Intègre l'éditeur de code Ace dans vos éditeurs WordPress pour vous aider à écrire du code plus efficacement!

source: Report
fr_fr: Rapport

source: Sending your report. Please wait...
fr_fr: Envoi de votre rapport. Veuillez patienter

source: Please fill the following form to report an error in the code check. If you want to hide pre-filled data, don't hesitate. No sensible informations, such as password, should be sent through this file. Please do appropriate checks.
fr_fr: Veuillez remplir le formulaire suivant pour repporter une erreur dans le vérificateur de code. N'hésitez pas à masquer les informations critiques, tels que les mots de passes, dans le formulaire pré-rempli ci-après.

source: Your name (better if I have to contact you about this problem)
fr_fr: Votre nom (mieux si j'ai besoin de vous recontacter concernant votre problème)

source: Your email
fr_fr: Votre email

source: Type of report
fr_fr: Type de rapport

source: Filename
fr_fr: Nom du fichier

source: Edited code
fr_fr: Code édité

source: Previously included files
fr_fr: Fichiers inclus précédemment

source: Please describe the problem
fr_fr: Veuillez décrire le problème

source: Send report
fr_fr: Envoyer le rapport

source: Enable client-side shortcode
fr_fr: Activer le shortcode client

source: Use it with <em>[ace_editor lang="yourlang"]$your->code()[/ace_editor]</em> in a <em>&lt;pre&gt;</em> tag. More infos on the <a href="https://www.gerkindevelopment.net/en/portfolio/ithoughts-advanced-code-editor/#Use_the_client_shortcode">plugin page</a>.
fr_fr: Utilisez le avec <em>[ace_editor lang="votrelang"]$votre->code()[/ace_editor]</em> dans un tag <em>&lt;pre&gt;</em> . Plus d'infos sur la <a href="https://www.gerkindevelopment.net/en/portfolio/ithoughts-advanced-code-editor/#Use_the_client_shortcode">page du plugin</a>.

source: Theme
fr_fr: Thème

source: Autocompletion
fr_fr: Autocomplétion

source: Autocomplete on demande <em>(Press ctrl+space)</em>
fr_fr: Autocomplétion à la demande <em>(Appuyez sur ctrl+espace)</em>

source: Live autocomplete <em>(suggest as you type)</em>
fr_fr: Autocomplétion en direct <em>(suggère pendant que vous écrivez)</em>

source: Update Options
fr_fr: Mettre à jour les options

source: Everything seems ok.
fr_fr: Tout semble ok.

source: Report a false negative?
fr_fr: Repporter un faux négatif?

source: An error has been found. Here are the lasts words from the server:
fr_fr: Une erreur a été trouvée. Voici les derniers mots du serveur:

source: Report a false positive?
fr_fr: Repporter un faux positif?

source: Report false positive/negative
fr_fr: Repporter un faux négatif/positif

source: Options updated
fr_fr: Options mises à jour

source: Could not update options
fr_fr: Impossible de mettre à jour les options

source: False Negative: there is an unspotted error
fr_fr: Faux négatif: il y a une erreur qui n'a pas été repérée

source: False Positive: an inexistent error was spotted
fr_fr: Faux positif: une erreur inexistante a été repérée

source: Please select
fr_fr: Veuillez sélectionner

source: Please provide a bit of code.
fr_fr: Veuillez mettre un minimum de code

source: You must specify if the report is a false positive or negative test.
fr_fr: Vous devez spécifier s'il s'agit d'un faux négatif ou positif.

source: Please provide the code to check with a bit of length.
fr_fr: Veuillez fournir le code à vérifier avec un minimum de longueur.

source: Please provide the file name to help debugging in context.
fr_fr: Veuillez spécifier le nom du fichier pour débugger dans le contexte.

source: Please describe precisely the problem you encounter.
fr_fr: Veuillez décrire précisément le problème que vous avez rencontré

source: Please omit only critical files.
fr_fr: Veuillez n'omettre que les fichiers critiques

source: Your report was sent. Thank you for your feedback.
fr_fr: Votre rapport a été envoyé. Merci de votre retour

source: Your report was not sent. Please check your server & WordPress mail configuration or retry later.
fr_fr: Votre rapport n'a pas été envoyé. Veuillez vérifier la configuration mail de votre serveur & WordPress ou réessayez plus tard.
